app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `profile_change_requests`
WHERE `is_approved` = 0
AND `is_rejected` = 0
---
    public function initController(\CodeIgniter\HTTP\RequestInterface $request, \CodeIgniter\HTTP\ResponseInterface $response, \Psr\Log\LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        // Basic Staff Check
        if (!session()->get('isLoggedIn') || !session()->get('is_staff')) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Global Pending Requests Count for Layout
        $requestModel = new ProfileChangeRequestModel();
        $pendingCount = $requestModel->where('is_approved', false)
                                     ->where('is_rejected', false)
                                     ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `audit_logs`
LEFT JOIN `users` ON `users`.`id` = `audit_logs`.`user_id`
SELECT `audit_logs`.*, `users`.`email`, `users`.`first_name`, `users`.`last_name`
FROM `audit_logs`
LEFT JOIN `users` ON `users`.`id` = `audit_logs`.`user_id`
ORDER BY `timestamp` DESC
 LIMIT 20, 20
SELECT DISTINCT `action`
FROM `audit_logs`
ORDER BY `action` ASC
---
    public function auditLogs()
    {
        $auditModel = new AuditModel();
        $get = $this->request->getGet();

        $search = $get['search'] ?? '';
        $action = $get['action'] ?? '';

        $query = $auditModel->select('audit_logs.*, users.email, users.first_name, users.last_name')
                          ->join('users', 'users.id = audit_logs.user_id', 'left')
                          ->orderBy('timestamp', 'DESC');

        if (!empty($search)) {
            $query->groupStart()
                  ->like('users.email', $search)
                  ->orLike('users.first_name', $search)
                  ->orLike('users.last_name', $search)
                  ->orLike('audit_logs.details', $search)
                  ->groupEnd();
        }

        if (!empty($action)) {
            $query->where('audit_logs.action', $action);
        }

        $logs = $query->paginate(20, 'default');

        // Fetch distinct actions for the filter dropdown
        $actions = $auditModel->select('action')->distinct()->orderBy('action', 'ASC')->findAll();

SELECT `profile_change_requests`.*, `users`.`first_name`, `users`.`last_name`, `users`.`department` as `current_dept`
FROM `profile_change_requests`
JOIN `users` ON `users`.`id` = `profile_change_requests`.`user_id`
WHERE `is_approved` = 0
AND `is_rejected` = 0
---
    public function profileRequests()
    {
        $requestModel = new ProfileChangeRequestModel();
        $requests = $requestModel->select('profile_change_requests.*, users.first_name, users.last_name, users.department as current_dept')
                                ->join('users', 'users.id = profile_change_requests.user_id')
                                ->where('is_approved', false)
                                ->where('is_rejected', false)
                                ->findAll();

SELECT *
FROM `profile_change_requests`
WHERE `profile_change_requests`.`id` = '5'
UPDATE `profile_change_requests` SET `is_approved` = 1
WHERE `profile_change_requests`.`id` IN ('5')
---
    public function approveProfileRequest($id)
    {
        $requestModel = new ProfileChangeRequestModel();
        $userModel = new UserModel();

        $request = $requestModel->find($id);
        if ($request) {
            $db = \Config\Database::connect();
            $db->transStart();

            // Update User
            $userData = [];
            if ($request['new_full_name']) {
                $parts = explode(' ', trim($request['new_full_name']), 2);
                $userData['first_name'] = $parts[0];
                $userData['last_name'] = $parts[1] ?? '';
            }
            if ($request['new_department']) {
                $userData['department'] = $request['new_department'];
            }

            if (!empty($userData)) {
                $userModel->update($request['user_id'], $userData);
            }

            // Mark Request Approved
            $requestModel->update($id, ['is_approved' => true]);

SELECT *
FROM `users`
WHERE `users`.`id` = '35'
---
            $db->transComplete();

            // Send Email Notification
            $user = $userModel->find($request['user_id']);

SELECT *
FROM `profile_change_requests`
WHERE `profile_change_requests`.`id` = '4'
UPDATE `profile_change_requests` SET `is_rejected` = 1
WHERE `profile_change_requests`.`id` IN ('4')
SELECT *
FROM `users`
WHERE `users`.`id` = '35'
---
    public function rejectProfileRequest($id)
    {
        $requestModel = new ProfileChangeRequestModel();
        $userModel = new UserModel();
        $emailLib = new EmailLibrary();

        $request = $requestModel->find($id);
        if ($request) {
            $requestModel->update($id, ['is_rejected' => true]);
            $user = $userModel->find($request['user_id']);