app/Controllers/Quiz.php

    public function start($assignmentId)
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $assignmentModel = new AssignmentModel();
        $quizModel = new \App\Models\QuizModel();

        $assignment = $assignmentModel->find($assignmentId);
---
SELECT *
FROM `quiz_assignments`
WHERE `quiz_assignments`.`id` = '21'

    public function take($assignmentId)
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $assignmentModel = new AssignmentModel();
        $attemptModel = new AttemptModel();
        $questionModel = new QuestionModel();
        $optionModel = new OptionModel();
        $responseModel = new ResponseModel();
        $auditModel = new AuditModel();
        $quizModel = new \App\Models\QuizModel();

        $assignment = $assignmentModel->find($assignmentId);
---
SELECT *
FROM `quiz_assignments`
WHERE `quiz_assignments`.`id` = '21'

        }

        // Check for existing attempt or create new
        $attempt = $attemptModel->where('assignment_id', $assignmentId)->first();
---
SELECT *
FROM `quiz_attempts`
WHERE `assignment_id` = '21'
 LIMIT 1

            // Use current server time for start_time
            $startTimeStr = date('Y-m-d H:i:s');

            $attemptModel->insert([
                'id' => $attemptIid,
                'assignment_id' => $assignmentId,
                'start_time' => $startTimeStr
            ]);
            $attempt = $attemptModel->find($attemptIid);

            // Randomize Questions (Reuse $quiz from line 102)
            $questions = $questionModel->where('topic_id', $quiz['topic_id'])->orderBy('id', 'RANDOM')->findAll($quiz['total_questions']);
---
INSERT INTO `quiz_attempts` (`id`, `assignment_id`, `start_time`) VALUES ('0723b15a-e207-4f6e-a2e4-6639efb153e5', '21', '2026-02-06 18:43:22')
SELECT *
FROM `quiz_attempts`
WHERE `quiz_attempts`.`id` = '0723b15a-e207-4f6e-a2e4-6639efb153e5'
SELECT *
FROM `questions`
WHERE `topic_id` = '1'
ORDER BY RAND()
 LIMIT 1

            }

            foreach ($questions as $q) {
                $responseModel->insert([
                    'attempt_id' => $attemptIid,
                    'question_id' => $q['id']
                ]);
            }

            $assignmentModel->update($assignmentId, ['status' => 'STARTED']);
---
INSERT INTO `user_responses` (`attempt_id`, `question_id`) VALUES ('0723b15a-e207-4f6e-a2e4-6639efb153e5', '1')
UPDATE `quiz_assignments` SET `status` = 'STARTED'
WHERE `quiz_assignments`.`id` IN ('21')

        }

        // Load responses and questions
        $responses = $responseModel->where('attempt_id', $attempt['id'])->findAll();
        $questions_data = [];
        foreach ($responses as $resp) {
            $q = $questionModel->find($resp['question_id']);
            $options = $optionModel->where('question_id', $q['id'])->findAll();
---
SELECT *
FROM `user_responses`
WHERE `attempt_id` = '0723b15a-e207-4f6e-a2e4-6639efb153e5'
SELECT *
FROM `questions`
WHERE `questions`.`id` = '1'
SELECT *
FROM `options`
WHERE `question_id` = '1'

    public function submit($assignmentId)
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $assignmentModel = new AssignmentModel();
        $attemptModel = new AttemptModel();
        $responseModel = new ResponseModel();
        $optionModel = new OptionModel();

        $assignment = $assignmentModel->find($assignmentId);

        if (! $assignment || $assignment['user_id'] != session()->get('id')) {
            return redirect()->to('/dashboard');
        }

        // IMPORTANT: Prevent resubmission of already completed quizzes
        // This avoids resetting the score to 0 if the user refreshes or clicks back
        if ($assignment['status'] === 'COMPLETED') {
            return redirect()->to('/quiz/success');
        }

        $attemptModel = new AttemptModel();
        $attempt = $attemptModel->where('assignment_id', $assignmentId)->first();

        $responses = $responseModel->where('attempt_id', $attempt['id'])->findAll();
---
SELECT *
FROM `quiz_assignments`
WHERE `quiz_assignments`.`id` = '21'
SELECT *
FROM `quiz_attempts`
WHERE `assignment_id` = '21'
 LIMIT 1
SELECT *
FROM `user_responses`
WHERE `attempt_id` = '0723b15a-e207-4f6e-a2e4-6639efb153e5'

        foreach ($responses as $resp) {
            $selectedOptionId = $this->request->getPost('response_' . $resp['id']);
            if ($selectedOptionId) {
                $option = $optionModel->find($selectedOptionId);
                $isCorrect = $option['is_correct'];
                if ($isCorrect) $scoreCount++;

                $responseModel->update($resp['id'], [
                    'selected_option_id' => $selectedOptionId,
                    'is_correct' => $isCorrect
                ]);
---
SELECT *
FROM `options`
WHERE `options`.`id` = '15'
UPDATE `user_responses` SET `selected_option_id` = '15', `is_correct` = 1
WHERE `user_responses`.`id` IN ('21')


        $finalScore = ($totalQuestions > 0) ? ($scoreCount / $totalQuestions) * 100 : 0;

        $assignmentModel->update($assignmentId, [
            'status' => 'COMPLETED',
            'completed_at' => date('Y-m-d H:i:s'),
            'score' => $finalScore
        ]);

        $attemptModel->update($attempt['id'], [
            'end_time' => date('Y-m-d H:i:s'),
            'score' => $finalScore
        ]);
---
UPDATE `quiz_assignments` SET `status` = 'COMPLETED', `completed_at` = '2026-02-06 18:43:26', `score` = 100
WHERE `quiz_assignments`.`id` IN ('21')
UPDATE `quiz_attempts` SET `end_time` = '2026-02-06 18:43:26', `score` = 100
WHERE `quiz_attempts`.`id` IN ('0723b15a-e207-4f6e-a2e4-6639efb153e5')

        // Use a small epsilon for float comparison safety, though round() is generally better for display scores
        if (round((float)$finalScore, 2) >= $passThreshold) {
            $userModel = new \App\Models\UserModel();
            $user = $userModel->find(session()->get('id'));

            $emailLib = new \App\Libraries\EmailLibrary();
            // Refresh assignment data to ensure we have the saved score and flags
            $assignmentData = $assignmentModel->find($assignmentId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '30'
SELECT *
FROM `quiz_assignments`
WHERE `quiz_assignments`.`id` = '21'

    public function logViolation($assignmentId)
    {
        $json = $this->request->getJSON();
        $type = $json->type ?? 'UNKNOWN';

        $attemptModel = new AttemptModel();
        $attempt = $attemptModel->where('assignment_id', $assignmentId)->first();

        if ($attempt) {
            if ($type === 'TAB_SWITCH') {
                $attemptModel->update($attempt['id'], ['tab_switch_violations' => $attempt['tab_switch_violations'] + 1]);
---
SELECT *
FROM `quiz_attempts`
WHERE `assignment_id` = '21'
 LIMIT 1
UPDATE `quiz_attempts` SET `tab_switch_violations` = 1
WHERE `quiz_attempts`.`id` IN ('0723b15a-e207-4f6e-a2e4-6639efb153e5')

    public function profile()
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $userModel = new UserModel();
        $requestModel = new ProfileChangeRequestModel();

        $userId = session()->get('id');
        $user = $userModel->find($userId);

        $activeRequest = $requestModel->where('user_id', $userId)
                                     ->where('is_approved', false)
                                     ->where('is_rejected', false)
                                     ->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '35'
SELECT *
FROM `profile_change_requests`
WHERE `user_id` = '35'
AND `is_approved` = 0
AND `is_rejected` = 0
 LIMIT 1

    public function saveProfileRequest()
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $requestModel = new ProfileChangeRequestModel();
        $userId = session()->get('id');

        // Check for existing pending request
        $existing = $requestModel->where('user_id', $userId)
                                ->where('is_approved', false)
                                ->where('is_rejected', false)
                                ->first();

        if ($existing) {
            return redirect()->back()->with('error', 'You already have a pending profile change request.');
        }

        $requestModel->insert([
            'user_id' => $userId,
            'new_full_name' => $this->request->getPost('new_full_name'),
            'new_department' => $this->request->getPost('new_department'),
            'is_approved' => false,
            'is_rejected' => false
        ]);
---
SELECT *
FROM `profile_change_requests`
WHERE `user_id` = '35'
AND `is_approved` = 0
AND `is_rejected` = 0
 LIMIT 1
INSERT INTO `profile_change_requests` (`user_id`, `new_full_name`, `new_department`, `is_approved`, `is_rejected`, `requested_at`) VALUES ('35', 'revanth1', 'cybersecurity1', 0, 0, '2026-02-09 12:31:25')

    public function certificate($assignmentId)
    {
        if (! session()->get('isLoggedIn')) return redirect()->to('/login');

        $assignmentModel = new \App\Models\AssignmentModel();
        $quizModel = new \App\Models\QuizModel();
        $userModel = new \App\Models\UserModel();

        $assignment = $assignmentModel->find($assignmentId);
        if (! $assignment || $assignment['user_id'] != session()->get('id')) {
            return redirect()->to('/dashboard');
        }

        if ($assignment['status'] !== 'COMPLETED') {
            return redirect()->to('/dashboard')->with('error', 'Certification is only available for completed assessments.');
        }

        $quiz = $quizModel->find($assignment['quiz_id']);
        $passThreshold = (int)($quiz['pass_score'] ?: 70);

        // Consistently use rounding for comparison to avoid floating point precision issues
        if (round((float)$assignment['score'], 2) < $passThreshold) {
            return redirect()->to('/dashboard')->with('error', 'You did not achieve the required passing score for this certificate.');
        }

        $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `quiz_assignments`
WHERE `quiz_assignments`.`id` = '21'
SELECT *
FROM `users`
WHERE `users`.`id` = '30'