app/Models/AssignmentModel.php

SELECT `quiz_assignments`.*, `quizzes`.`name` as `quiz_name`, `quizzes`.`duration_minutes`, `quizzes`.`start_time`, `quizzes`.`end_time`, `quizzes`.`pass_score`, `quizzes`.`results_released`, `topics`.`name` as `topic_name`, `quizzes`.`difficulty`
FROM `quiz_assignments`
JOIN `quizzes` ON `quizzes`.`id` = `quiz_assignments`.`quiz_id`
LEFT JOIN `topics` ON `topics`.`id` = `quizzes`.`topic_id`
WHERE `user_id` = '30'
---
    public function getAssignmentsByUser($userId)
    {
        return $this->select('quiz_assignments.*, quizzes.name as quiz_name, quizzes.duration_minutes, quizzes.start_time, quizzes.end_time, quizzes.results_released, topics.name as topic_name, quizzes.difficulty')
                    ->join('quizzes', 'quizzes.id = quiz_assignments.quiz_id')
                    ->join('topics', 'topics.id = quizzes.topic_id', 'left')
                    ->where('user_id', $userId)
                    ->findAll();